tap "colindean/fonts-nonfree"
tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Official Amazon AWS command-line interface
brew "awscli"
# Crop PDF files
brew "briss"
# GNU compiler collection
brew "gcc"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Git for data science projects
brew "dvc"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Git extension for versioning large files
brew "git-lfs"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# I/O abstraction library for dealing with structured file formats
brew "libgsf"
# Gnumeric spreadsheet program
brew "goffice"
# GNOME XML library
brew "libxml2"
# GNOME Spreadsheet Application
brew "gnumeric"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Make XML documents translatable through PO files
brew "itstool"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", link: false
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Open source continuous file synchronization application
brew "syncthing"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool to track (your) time
brew "watson"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Multi-track audio editor and recorder
cask "audacity"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Cloud storage service
cask "baidunetdisk"
# Official bilibili video streaming and sharing platform
cask "bilibili"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Managed desktop virtualization solution
cask "citrix-workspace"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-iosevka"
cask "font-microsoft-office"
# Audio player
cask "foobar2000"
# Desktop customization tool
cask "geektool"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Snippet management app
cask "lepton"
# E-reader
cask "marginnote"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Minimal installer for conda
cask "miniconda"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Interactive media player
cask "qiyimedia"
# Environment for statistical computing and graphics
cask "r"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Spaced-repetition powered note-taking tool
cask "remnote"
# Data science software focusing on R and Python
cask "rstudio"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "webex"
# Torrent streaming application
cask "webtorrent"
# View output from scripts in the menu bar
cask "xbar"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Cryptowatch Desktop", id: 1527457231
mas "Dropover", id: 1355679052
mas "Endel", id: 1484348796
mas "GoodNotes", id: 1444383602
mas "Horo", id: 1437226581
mas "MenuBarTODO", id: 1550343840
mas "MiniNote", id: 492486856
mas "MyWallpaper", id: 1552826194
mas "Notability", id: 360593530
mas "Notion Web Clipper", id: 1559269364
mas "Pages", id: 409201541
mas "Session", id: 1521432881
mas "SnippetsLab", id: 1006087419
mas "Unsplash Wallpapers", id: 1284863847
mas "WeChat", id: 836500024
mas "WhatsApp", id: 1147396723
vscode "aaron-bond.better-comments"
vscode "ahebrank.yaml2json"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "anseki.vscode-color"
vscode "bianxianyang.htmlplay"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "cfgweb.vscode-perl"
vscode "colinfang.my-nbpreviewer"
vscode "cweijan.vscode-office"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "guidotapia2.unicode-math-vscode"
vscode "guyskk.language-cython"
vscode "hediet.vscode-drawio"
vscode "henoc.color-scheme-selector"
vscode "hilleer.yaml-plus-json"
vscode "hwencc.html-tag-wrapper"
vscode "idleberg.icon-fonts"
vscode "james-yu.latex-workshop"
vscode "jeffersonmourak.vs-code-note"
vscode "jithurjacob.nbpreviewer"
vscode "kkozee.theme-one-dark-vivid"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msjsdiag.debugger-for-chrome"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "rogalmic.bash-debug"
vscode "shan.code-settings-sync"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "torn4dom4n.latex-support"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wangtao0101.debug-leetcode"
vscode "xadillax.viml"
vscode "xboxyan.tree-generator"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zcfrank1st.flowchart"
vscode "zhucy.project-tree"
